src/Catalogs/ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТокенаАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТокеновАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ответственные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВСекундах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиОбменаСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОбменаСУЗ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеРасписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбменНаКлиентеПоРасписанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучатьКодовЗаИтерацию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоКодовВЗаказе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСоединения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъектАдрес</Name>
					<Comment>Внутренние значения полей адреса доставки (контактная информация)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроизводственныйОбъектАдресСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодФИАС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РабочиеМестаИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтанцияУправленияЗаказами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииУправленияЗаказамиИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизводственныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПроизводственныйОбъектИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыТокеновАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТокеновАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СУЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИСМПРозница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТипТокенаАвторизации");
	Поля.Добавить("Организация");
	Поля.Добавить("ПроизводственныйОбъект");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Данные.ТипТокенаАвторизации) Тогда
		ТипТокенаАвторизации = СтрШаблон(НСтр("ru = 'токены %1'"), Строка(Данные.ТипТокенаАвторизации));
	Иначе
		ТипТокенаАвторизации = НСтр("ru = '<все токены>'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Организация) Тогда
		Организация = Строка(Данные.Организация);
	Иначе
		Организация = НСтр("ru = '<для всех организаций>'");
	КонецЕсли;
	
	Если Данные.ТипТокенаАвторизации = Перечисления.ТипыТокеновАвторизации.ИСМП Тогда
		
		Представление = СтрШаблон("%1, %2",
			ТипТокенаАвторизации, Организация);
		
	Иначе
		
		Если ЗначениеЗаполнено(Данные.ПроизводственныйОбъект) Тогда
			ПроизводственныйОбъект = Строка(Данные.ПроизводственныйОбъект);
		Иначе
			ПроизводственныйОбъект = НСтр("ru = '<для всех производственных объектов>'");
		КонецЕсли;
		
		Представление = СтрШаблон("%1, %2, %3",
			ТипТокенаАвторизации, Организация, ПроизводственныйОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Получает настройки текущего пользователя для актуализации токенов авторизации.
// 
// Параметры:
//  ДляПросмотра - Булево - определяет для чего нужно получить настройки:
//                          для просмотра списка токенов или для актуализации токенов.
// 
// Возвращаемое значение:
//  Массив из Структура:
//   * ТипТокенаАвторизации   - ПеречислениеСсылка.ТипыТокеновАвторизации - тип токена авторизации.
//   * Организация            - ОпределяемыйТип.Организация - организация.
//   * ПроизводственныйОбъект - ОпределяемыйТип.ПроизводственныйОбъектИС - производственный объект.
//   * ВремяОповещения        - Число - время в секундах, за которое необходимо оповестить ответственного об окончании срока действия токена.
//
Функция НастройкиОтветственногоЗаАктуализациюТокеновАвторизации(ДляПросмотра) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Настройки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ответственный", Пользователи.АвторизованныйПользователь());
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ИСМП) КАК ТипТокенаАвторизации,
	|	Ответственные.Ссылка.Организация КАК Организация,
	|	Null КАК ПроизводственныйОбъект,
	|	МАКСИМУМ(Ответственные.ВремяВСекундах) КАК ВремяВСекундах
	|ИЗ
	|	Справочник.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.Ответственные КАК Ответственные
	|ГДЕ
	|	Ответственные.Ответственный = &Ответственный
	|	И НЕ Ответственные.Ссылка.ПометкаУдаления
	|	И (Ответственные.Ссылка.ТипТокенаАвторизации = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ПустаяСсылка)
	|	ИЛИ Ответственные.Ссылка.ТипТокенаАвторизации = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ИСМП))
	|СГРУППИРОВАТЬ ПО
	|	ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ИСМП),
	|	Ответственные.Ссылка.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.СУЗ) КАК ТипТокенаАвторизации,
	|	Ответственные.Ссылка.Организация КАК Организация,
	|	Ответственные.Ссылка.ПроизводственныйОбъект КАК ПроизводственныйОбъект,
	|	МАКСИМУМ(Ответственные.ВремяВСекундах) КАК ВремяВСекундах
	|ИЗ
	|	Справочник.ОтветственныеЗаАктуализациюТокеновАвторизацииИСМП.Ответственные КАК Ответственные
	|ГДЕ
	|	Ответственные.Ответственный = &Ответственный
	|	И НЕ Ответственные.Ссылка.ПометкаУдаления
	|	И (Ответственные.Ссылка.ТипТокенаАвторизации = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.ПустаяСсылка)
	|	ИЛИ Ответственные.Ссылка.ТипТокенаАвторизации = ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.СУЗ))
	|СГРУППИРОВАТЬ ПО
	|	ЗНАЧЕНИЕ(Перечисление.ТипыТокеновАвторизации.СУЗ),
	|	Ответственные.Ссылка.Организация,
	|	Ответственные.Ссылка.ПроизводственныйОбъект";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Если Не ДляПросмотра
		И ТаблицаДанных.Количество() = 0 Тогда
		Возврат Настройки;
	КонецЕсли;
	
	СертификатыДляПодписанияНаСервере = ИнтерфейсАвторизацииИСМПСлужебный.СертификатыДляПодписанияНаСервере();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	// токены ИС МП
	Таблица = ТаблицаДанных.Скопировать(
		Новый Структура("ТипТокенаАвторизации", Перечисления.ТипыТокеновАвторизации.ИСМП),
		"Организация, ВремяВСекундах");
	
	ВремяОповещенияПоВсемОрганизациям = 0;
	
	ОрганизацииПоОтветственному = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Организация) Тогда
			ОрганизацииПоОтветственному.Вставить(СтрокаТаблицы.Организация, СтрокаТаблицы.ВремяВСекундах);
		Иначе
			ВремяОповещенияПоВсемОрганизациям = СтрокаТаблицы.ВремяВСекундах;
		КонецЕсли;
		
	КонецЦикла;
	
	СертификатыПоОрганизациям = ОбщегоНазначенияИС.СертификатыПользователяДляПодписиПоОрганизациям(
		ОбщегоНазначенияИС.ДоступныеОрганизации().ВыгрузитьЗначения(), Истина);
	
	ДоступныеОрганизации = Новый Массив;
	Для Каждого КлючИЗначение Из СертификатыПоОрганизациям Цикл
		Если КлючИЗначение.Значение.Количество() > 0 Тогда
			ДоступныеОрганизации.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Организация Из ДоступныеОрганизации Цикл
		
		Если СертификатыДляПодписанияНаСервере <> Неопределено
			И СертификатыДляПодписанияНаСервере.Сертификаты.Найти(Организация, "Организация") <> Неопределено Тогда
			ВремяОповещения = 0;
		ИначеЕсли ОрганизацииПоОтветственному[Организация] = Неопределено Тогда
			ВремяОповещения = ВремяОповещенияПоВсемОрганизациям;
		Иначе
			ВремяОповещения = ОрганизацииПоОтветственному[Организация];
		КонецЕсли;
		
		Настройка = Новый Структура;
		Настройка.Вставить("ТипТокенаАвторизации",   Перечисления.ТипыТокеновАвторизации.ИСМП);
		Настройка.Вставить("Организация",            Организация);
		Настройка.Вставить("ПроизводственныйОбъект", Неопределено);
		Настройка.Вставить("ВремяОповещения",        ВремяОповещения);
		Настройки.Добавить(Настройка);
		
	КонецЦикла;
	
	// токены ИС МП Розница
	ДоступныеОрганизации = ОбщегоНазначенияИС.ДоступныеОрганизации().ВыгрузитьЗначения();
	
	Для Каждого Организация Из ДоступныеОрганизации Цикл
		
		ВремяОповещения = 0;
		
		Настройка = Новый Структура;
		Настройка.Вставить("ТипТокенаАвторизации",   Перечисления.ТипыТокеновАвторизации.ИСМПРозница);
		Настройка.Вставить("Организация",            Организация);
		Настройка.Вставить("ПроизводственныйОбъект", Неопределено);
		Настройка.Вставить("ВремяОповещения",        ВремяОповещения);
		Настройки.Добавить(Настройка);
		
	КонецЦикла;
	
	// токены СУЗ
	Таблица = ТаблицаДанных.Скопировать(
		Новый Структура("ТипТокенаАвторизации", Перечисления.ТипыТокеновАвторизации.СУЗ),
		"Организация, ПроизводственныйОбъект, ВремяВСекундах");
	
	ПустаяОрганизация = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("Организация");
	Если ПустаяОрганизация = Неопределено Тогда
		ПустаяОрганизация = "<ПоВсем>";
	КонецЕсли;
	
	ПустойПроизводственныйОбъект = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа("ПроизводственныйОбъектИС");
	Если ПустойПроизводственныйОбъект = Неопределено Тогда
		ПустойПроизводственныйОбъект = "<ПоВсем>";
	КонецЕсли;
	
	ОрганизацииПоОтветственному = Новый Соответствие;
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Организация) Тогда
			Организация = СтрокаТаблицы.Организация;
		Иначе
			Организация = ПустаяОрганизация;
		КонецЕсли;
		
		ОрганизацияПоОтветственному = ОрганизацииПоОтветственному[Организация];
		Если ОрганизацияПоОтветственному = Неопределено Тогда
			ОрганизацииПоОтветственному.Вставить(Организация, Новый Соответствие);
			ОрганизацияПоОтветственному = ОрганизацииПоОтветственному[Организация];
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.ПроизводственныйОбъект) Тогда
			ПроизводственныйОбъект = СтрокаТаблицы.ПроизводственныйОбъект;
		Иначе
			ПроизводственныйОбъект = ПустойПроизводственныйОбъект;
		КонецЕсли;
		
		ОрганизацияПоОтветственному.Вставить(ПроизводственныйОбъект, СтрокаТаблицы.ВремяВСекундах);
		
	КонецЦикла;
	
	Если ОбщегоНазначенияИСКлиентСервер.ЭтоРасширеннаяВерсияГосИС() Тогда
		
		ПараметрыДополнения = Новый Структура;
		ПараметрыДополнения.Вставить("ДоступныеОрганизации", ДоступныеОрганизации);
		ПараметрыДополнения.Вставить("СертификатыДляПодписанияНаСервере", СертификатыДляПодписанияНаСервере);
		ПараметрыДополнения.Вставить("ОрганизацииПоОтветственному", ОрганизацииПоОтветственному);
		ПараметрыДополнения.Вставить("ПустаяОрганизация", ПустаяОрганизация);
		ПараметрыДополнения.Вставить("ПустойПроизводственныйОбъект", ПустойПроизводственныйОбъект);
		ПараметрыДополнения.Вставить("Настройки", Настройки);
		
		НастройкиОбменаСУЗ = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("РегистрСведений.НастройкиОбменаСУЗ");
		НастройкиОбменаСУЗ.ДополнитьТокенамиСУЗ(ПараметрыДополнения);
		
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
